monte-monte/ch32v003fun/examples_v20x/spi_dma_chain/spi_dma_chain.c
	IRQn_Type irqn;
	if (pin < 5) irqn = (IRQn_Type)((uint8_t)EXTI0_IRQn + pin);
	else if (pin < 10) irqn = EXTI9_5_IRQn;
	else irqn = EXTI15_10_IRQn;

	// printf("exti priority %02x\n", NVIC);
	NVIC_EnableIRQ(irqn);
#if defined(FUNCONF_ENABLE_HPE) && FUNCONF_ENABLE_HPE
	NVIC_SetPriority(irqn, 0<<7); // Set HIGH preemptive priority for the IRQ
#endif
	EXTI->INTENR |= 1 << pin; // Enable EXTIx interrupt
}

void setupDMA(uint8_t ch, SPI_TypeDef * spi, uint8_t mode, uint8_t sixteen_bits, uint8_t* buffer)
{
	RCC->AHBPCENR |= RCC_AHBPeriph_DMA1;

	DMA1_CH(ch)->PADDR = (uint32_t)&spi->DATAR;
	DMA1_CH(ch)->MADDR = (uint32_t)buffer;
	DMA1_CH(ch)->CNTR  = (mode?0:BUFFER_SIZE);
	DMA1_CH(ch)->CFGR  =
		DMA_M2M_Disable |
		(mode?DMA_Priority_VeryHigh:DMA_Priority_High) |
		(sixteen_bits?DMA_MemoryDataSize_Word:DMA_MemoryDataSize_Byte) |
		(sixteen_bits?DMA_PeripheralDataSize_Word:DMA_PeripheralDataSize_Byte) |
		DMA_MemoryInc_Enable |
		(mode?DMA_Mode_Normal:DMA_Mode_Circular) |
		(mode?DMA_DIR_PeripheralDST:DMA_DIR_PeripheralSRC) |
		(mode?DMA_IT_TC:0);

	if (mode) {
		NVIC_EnableIRQ( DMA1_IRQ(ch) );
#if defined(FUNCONF_ENABLE_HPE) && FUNCONF_ENABLE_HPE && (TARGET_MCU!=CH32V103)
		NVIC_SetPriority(DMA1_IRQ(ch), 1<<7);
#endif
	}
	DMA1_CH(ch)->CFGR |= DMA_CFGR1_EN;
}

void setup_SPI(spi_t * spi, uint8_t mode, uint8_t sixteen_bits)
{
	printf("SPI%d - %s\n", (spi->addr == SPI1)?1:2, mode?"master":"slave");

	// I've found that GPIO modes other than 2MHz, at least in case of slave SPI MISO doesn't really work that great (if at all).
	// 2MHz is more stable and I didn't find any downsides.
	if (spi->addr == SPI1) {
		funPinMode(SPI1_CS1, mode?GPIO_CFGLR_OUT_2Mhz_PP:GPIO_CNF_IN_PUPD);
		funPinMode(PA5, mode?GPIO_CFGLR_OUT_2Mhz_AF_PP:GPIO_CNF_IN_FLOATING);
		funPinMode(PA6, mode?GPIO_CNF_IN_FLOATING:GPIO_CFGLR_OUT_2Mhz_AF_PP);
		funPinMode(PA7, mode?GPIO_CFGLR_OUT_2Mhz_AF_PP:GPIO_CNF_IN_FLOATING);
		RCC->APB2PRSTR = RCC_SPI1RST;
		RCC->APB2PRSTR = 0;
		RCC->APB2PCENR |= RCC_APB2Periph_SPI1;
	} else {
		funPinMode(SPI2_CS1, mode?GPIO_CFGLR_OUT_2Mhz_PP:GPIO_CNF_IN_PUPD);
		funPinMode(PB13, mode?GPIO_CFGLR_OUT_2Mhz_AF_PP:GPIO_CNF_IN_FLOATING);
		funPinMode(PB14, mode?GPIO_CNF_IN_FLOATING:GPIO_CFGLR_OUT_2Mhz_AF_PP);
		funPinMode(PB15, mode?GPIO_CFGLR_OUT_2Mhz_AF_PP:GPIO_CNF_IN_FLOATING);
		RCC->APB1PRSTR = RCC_SPI2RST;
		RCC->APB1PRSTR = 0;
		RCC->APB1PCENR |= RCC_APB1Periph_SPI2;
	}

	// Configure SPI
	spi->addr->CTLR1 = (mode?SPI_NSS_Soft:0) | SPI_CPHA_1Edge | SPI_CPOL_Low | (sixteen_bits?SPI_DataSize_16b:0) | SPI_BaudRatePrescaler_16 | (mode?SPI_Mode_Master:0);
	// spi->CRCR = 7;

	// DMA only works in Master mode for some reason. Need to use interrupts in Slave mode.
	if (mode) {
		spi->master = 1;
		spi->addr->CTLR2 = SPI_CTLR2_RXDMAEN | SPI_CTLR2_TXDMAEN;
		
		if (spi->addr == SPI1) {
			setupDMA(2, spi->addr, DMA_In, sixteen_bits, spi->buffer->in);
			setupDMA(3, spi->addr, DMA_Out, sixteen_bits, spi->buffer->out);
		} else {
			setupDMA(4, spi->addr, DMA_In, sixteen_bits, spi->buffer->in);
			setupDMA(5, spi->addr, DMA_Out, sixteen_bits, spi->buffer->out);
		}
	}

	spi->addr->CTLR1 |= CTLR1_SPE_Set; // Enable SPI

}

void spi_send(spi_t * spi, uint8_t n_packets) {
#if DEBUG_SPI
	printf("%s OUT ", (spi->master?"Master":"Slave"));
	printf("[%ld] %02x %02x %02x %02x %02x %02x %02x %02x\n", spi->buffer->pos_out, spi->buffer->out[spi->buffer->pos_out], spi->buffer->out[spi->buffer->pos_out+1], spi->buffer->out[spi->buffer->pos_out+2], spi->buffer->out[spi->buffer->pos_out+3], spi->buffer->out[spi->buffer->pos_out+4], spi->buffer->out[spi->buffer->pos_out+5], spi->buffer->out[spi->buffer->pos_out+6], spi->buffer->out[spi->buffer->pos_out+7]);
#endif
	// Update position in buffer for next data
	// Loop the buffer if needed
	if ((spi->buffer->pos_out += PACKET_SIZE * n_packets) >= BUFFER_SIZE) spi->buffer->pos_out -= BUFFER_SIZE;

	// Master needs to initiate a transmission if it's not in progress already
	// Slave will transmit in interrupt when master will initiate, so nothing to do here
	if (spi->master && spi->transmission == SPI_IDLE) {
		spi->dma_out->CFGR &= ~DMA_CFGR1_EN; // Disable DMA to be able to make changes
		spi->dma_out->MADDR = (uint32_t)&spi->buffer->out[spi->buffer->sending_pos]; // Update buffer postion address

		if (spi->buffer->sending_pos >= spi->buffer->pos_out) { // This means we are looping over buffer
			spi->dma_out->CNTR = BUFFER_SIZE - spi->buffer->sending_pos;
			spi->buffer->sending_pos = 0; // We'll send the rest in another transmission
		} else {
			spi->dma_out->CNTR = spi->buffer->pos_out - spi->buffer->sending_pos;
			spi->buffer->sending_pos = spi->buffer->pos_out;
		}

		funDigitalWrite(spi->cs_pin, 0); // CS low to start transmission
		spi->transmission = SPI_IN_PROGRESS;
		Delay_Ms(2); // Let slave to react
		spi->dma_out->CFGR |= DMA_CFGR1_EN;
		polling_timer = SysTick->CNT + Ticks_from_Ms(SPI_POLLING_INTERVAL);
	}
}

void spi_send_message(spi_t * spi, uint8_t receiver_id, uint16_t message_id, uint8_t* buf, uint8_t len) {
#if !SPI_FORCED_SENDING
	if (spi->nodes.map[0] == 0) return;
#endif
	if (!len) return;

	spi->buffer->out[spi->buffer->pos_out] = (uint8_t)NODE_ID;
	spi->buffer->out[spi->buffer->pos_out+1] = receiver_id;
	if (!message_id) {
		if (spi->message_number++ > 16383) spi->message_number = 1;
		spi->buffer->out[spi->buffer->pos_out+2] = (uint8_t)(spi->message_number>>6);
		spi->buffer->out[spi->buffer->pos_out+3] = (uint8_t)((spi->message_number<<2) | 3);
	} else {
		spi->buffer->out[spi->buffer->pos_out+2] = (uint8_t)(message_id>>6);
		spi->buffer->out[spi->buffer->pos_out+3] = (uint8_t)(message_id);
	}

	// TODO: make a loop to send long messages in multiple packets
	if (len > PACKET_SIZE - 4) len = PACKET_SIZE - 4;
	if (len < PACKET_SIZE - 4) memset(&spi->buffer->out[spi->buffer->pos_out+4+len], 0, PACKET_SIZE - 4 - len);
	memcpy(&spi->buffer->out[spi->buffer->pos_out+4], buf, len);

	spi_send(spi, 1);
}

void spi_send_control(spi_t * spi, uint8_t receiver_id, uint16_t message_id, uint8_t ack) {
#if !SPI_FORCED_SENDING
	if (spi->nodes.map[0] == 0) return;
#endif
	spi->buffer->out[spi->buffer->pos_out] = (uint8_t)NODE_ID;
	spi->buffer->out[spi->buffer->pos_out+1] = receiver_id;
	spi->buffer->out[spi->buffer->pos_out+2] = (uint8_t)(message_id>>6);
	spi->buffer->out[spi->buffer->pos_out+3] = (uint8_t)(message_id);

	// second bit 1 - ACK, 0 - NAK
	if (ack) spi->buffer->out[spi->buffer->pos_out+3] |= 2;
	else spi->buffer->out[spi->buffer->pos_out+3] &= ~(2);
	for (int i = 4; i < PACKET_SIZE; i++) {
		spi->buffer->out[spi->buffer->pos_out+i] = 0;
	}

