monte-monte/ch32v003fun/examples_v20x/spi_dma_chain/spi_dma_chain.c
	spi_send(spi, 1);
}

void spi_poll() {
#if SPI_ENABLE_POLLING
#if DEBUG_SPI
	printf("Polling...\n");
#endif
	// Slave will ignore empty message, but will send any data it has to send
	spi_master->buffer->out[spi_master->buffer->pos_out] = NODE_ID;
	for (int i = 1; i < PACKET_SIZE; i++) {
		spi_master->buffer->out[spi_master->buffer->pos_out + i] = 0;
	}
	spi_send(spi_master, 1);
#endif
}

void enumerate(spi_t * spi, command_t cmd) {
#if DEBUG_SPI
	printf("%s ENUM OUT %d\n", spi->master?"Master":"Slave", cmd);
#endif
	if (cmd == CMD_ENUM_UPDATE && spi->another->nodes.n_nodes && spi->nodes.n_nodes) {
		spi_send_message(spi, spi->nodes.map[0], 0, (uint8_t*)(&(uint8_t[]){CMD_ENUM_UPDATE, spi->another->nodes.map[0], spi->another->nodes.map[1], spi->another->nodes.map[2], spi->another->nodes.map[3], spi->another->nodes.map[4]}), 6);
		if (spi->another->nodes.n_nodes > 5) {
			spi_send_message(spi, spi->nodes.map[0], (spi->message_number<<2)|1, &spi->another->nodes.map[5], spi->another->nodes.n_nodes - 5);
			spi_send_message(spi, spi->nodes.map[0], (spi->message_number<<2)|1, (uint8_t*)(&(uint8_t[]){0xff}), 1);
		}
	} else if (cmd == CMD_ENUM_REQUEST) {
		spi_send_message(spi, spi->nodes.map[0], 0, (uint8_t[]){CMD_ENUM_REQUEST}, 1);
		spi->out_pending_command.type = CMD_ENUM_REQUEST;
		spi->out_pending_command.msg_number = spi->message_number;
	} else if (cmd == CMD_ENUM_REPLY) {
		if (spi->another->nodes.n_nodes) { // Not necessary chack but for clearance
			spi_send_message(spi, spi->nodes.map[0], (spi->in_pending_command.msg_number<<2)|2, &spi->another->nodes.map[0], spi->another->nodes.n_nodes);
		}
		spi_send_message(spi, spi->nodes.map[0], (spi->in_pending_command.msg_number<<2)|2, (uint8_t*)(&(uint8_t[]){0xff}), 1);
	}
}

void process_message(spi_t * spi) {
	if ((uint8_t)spi->enumeration_state > (uint8_t)ENUM_DONE ) {
		// Send to another part of the chain updated nodes map
		enumerate(spi->another, CMD_ENUM_UPDATE);
		// If we found a new neighbour we want to send our known map to it too
		if (spi->enumeration_state == ENUM_INIT) {
			enumerate(spi, CMD_ENUM_UPDATE);
			spi->enumeration_state = ENUM_WAIT;
			reloadTimer(enum_timer, ENUM_REQUEST_DELAY);
		} else {
			spi->enumeration_state = ENUM_DONE;
		}
		
		printf("SPI %s nodes map updated: [%02X", (spi->master?"master":"slave"), spi->nodes.map[0]);
		for (int i = 1; i < spi->nodes.n_nodes; i++) {
			printf(", %02X", spi->nodes.map[i]);
		}
		printf("]\n");
	}

	if (spi->incomming_message_pos < 0 || spi->transmission_size == 0) {
		// spi->transmission_packets_n = 0;
		// spi->incomming_message_pos = -1;
		return;
	}

	uint8_t local_message[PACKET_SIZE];
	
	do {
		// Copying a message to process, so it won't be overwritten by the IRQ in the process
		memcpy(local_message, &spi->buffer->in[spi->incomming_message_pos], PACKET_SIZE);

#if DEBUG_SPI
		printf("%s IN ", spi->master?"Master":"Slave");
		for (int n = 0; n < PACKET_SIZE; n++) {
			printf("%02x ", local_message[n]);
		}
		printf("\n");
#endif
		
		if (spi->incomming_message_pos += PACKET_SIZE >= BUFFER_SIZE) spi->incomming_message_pos = 0;
		// Check the message number that is located in 3rd and 4th bits
		uint16_t message_id = (local_message[2]<<8) | local_message[3];
		// Valid message always has to have a number
		// It should be filtered in process_incomming, but still checking here
		if (!message_id) continue;
		// LSB of the message number is to mark new message vs a reply
		uint16_t message_number = message_id >> 2;

		bool message_is_reply = !(message_id & 1);
		bool message_is_new = message_id & 1;
		bool ack = message_id & 2;
		bool message_is_sequel = (message_is_new && !ack);

		// Resend a command/message if NAK received while we waited a proper answer
		if (message_is_reply && !ack && spi->out_pending_command.type != CMD_IDLE && spi->out_pending_command.msg_number == message_number) {
			spi_send_message(spi, spi->previous_out_message[0], 0, spi->previous_out_message, PACKET_SIZE);
		// If this is a new message and we have no ongoing commands to finish
		} else if (message_is_new && spi->in_pending_command.type == CMD_IDLE) {
			spi->in_pending_command.msg_number = message_number;
			switch (local_message[4]) {
				case CMD_ENUM_REQUEST:
					printf("CMD_ENUM_REQUEST\n");
					// Send enumberate command downstream
					enumerate(spi, CMD_ENUM_REPLY);
					break;
				case CMD_ENUM_UPDATE:
					printf("CMD_ENUM_UPDATE\n");
					spi->in_pending_command.type = CMD_ENUM_UPDATE;
					spi->nodes.n_nodes = 1; // Rewrite any old nodes in map
					for (int i = 5; i < PACKET_SIZE; i++) {
						if (local_message[i] == 0xff || local_message[i] == 0) {
							spi->in_pending_command.type = CMD_IDLE;
							// Send nodes map update if there is actually anything
							if (spi->nodes.n_nodes > 1) spi->enumeration_state = ENUM_CHANGED;
							break;
						}
						spi->nodes.map[spi->nodes.n_nodes++] = local_message[i];
					}
					break;
				case CMD_LED_TOGGLE:
					printf("CMD_LED_TOGGLE\n");
					// Turn LED on/off
					// Ack
					funDigitalWrite(LED, !funDigitalRead(LED));
					spi_send_control(spi, local_message[0], message_number<<2, 1);
					break;
				case CMD_LED_OFF:
					printf("CMD_LED_OFF\n");
					funDigitalWrite(LED, !LED_ON);
					spi_send_control(spi, local_message[0], message_number<<2, 1);
					break;
				case CMD_LED_ON:
					printf("CMD_LED_ON\n");
					funDigitalWrite(LED, LED_ON);
					spi_send_control(spi, local_message[0], message_number<<2, 1);
					break;
				case CMD_READ_SENSOR:
					printf("CMD_READ_SENSOR\n");
					// read_sensor_local();
					// spi->in_pending_command.type = local_message[4];
					// Or send cashed data if we do it frequently
					break;
				default:
					break;
			}
		// If this is a new message, but we are still finishing replying to previous
		} else if (spi->in_pending_command.type != CMD_IDLE) {
			// TODO: Make a timeout for pending messages. Otherwise it can break if node doesn't reply.
			if (spi->in_pending_command.msg_number != message_number || !message_is_sequel) {
				printf("Unanswer message is pending: %d. Incomming message skipped.\n", spi->in_pending_command.type);
				// Maybe NAK here so the sender can repeat request later
				spi_send_control(spi, local_message[0], message_number, 0);
				continue; // Don't synchronize message number, skip to next message 
			}
			switch (spi->in_pending_command.type) {
				case CMD_ENUM_UPDATE:
					printf("CMD_ENUM_UPDATE SEQ\n");
					for (int i = 4; i < PACKET_SIZE; i++) {
						if (local_message[i] == 0xff || local_message[i] == 0) {
							spi->out_pending_command.type = CMD_IDLE;
							if (spi->nodes.n_nodes > 1) spi->enumeration_state = ENUM_CHANGED;
							break;
						}
						spi->nodes.map[spi->nodes.n_nodes++] = local_message[i];
					}
					break;
			}
		// If this is a reply and we are waiting for one
		} else if (!message_is_new && spi->out_pending_command.type != CMD_IDLE) {
			// And if this is a reply to a correct message
			if (message_number == spi->out_pending_command.msg_number) {
				switch (spi->out_pending_command.type) {
					case CMD_ENUM_REQUEST:
					case CMD_ENUM_UPDATE:
						for (int i = 4; i < PACKET_SIZE; i++) {
							if (local_message[i] == 0xff || local_message[i] == 0) {
								spi->out_pending_command.type = CMD_IDLE;
								if (spi->nodes.n_nodes > 1)  spi->enumeration_state = ENUM_CHANGED;
								break;
							}
							spi->nodes.map[spi->nodes.n_nodes++] = local_message[i];
						}
						break;
					case CMD_LED_TOGGLE:
						spi->out_pending_command.type = CMD_IDLE;
						break;
					case CMD_READ_SENSOR:
						// Process incomming sensor data, just printing for now
						printf("Sensor data from [%02X]:%02x-%02x-%02x-%02x-%02x-%02x\n", local_message[1], local_message[4], local_message[5], local_message[6], local_message[7], local_message[8], local_message[9]);
						spi->out_pending_command.type = CMD_IDLE;
						break;
				}
			} else {
				// This shouldn't happen? A reply with a different number, where would it come from?
				printf("Unexpected message number: %d, expected: %d. ID %04x\n", message_number, spi->out_pending_command.msg_number, message_id);
				continue;
			}
		// If this is a reply but we didn't request anything - act confused but do nothing
		} else if (!message_is_new) {
			printf("Unexpected reply. Number: %d, ID: %04x. ", message_id, message_number);
			for (uint8_t i = 0; i < PACKET_SIZE; i++) {
				printf("%02x ", local_message[i]);
			}
			printf("\n");
		}
		// Syncronize message number?
		// Can potentially cause problem if incomming message with a different number from not neighboring node
		// if (spi->message_number == old_number) {
		// 	spi->message_number = message_number;
		// }
	} while ((spi->transmission_size -= PACKET_SIZE) > 0);
	spi->transmission_size = 0;
	spi->incomming_message_pos = -1;
}

void read_sensor_local() {
	SPI_TypeDef * master = spi_master->addr;

	while ((master->STATR & SPI_I2S_FLAG_BSY)) {
		funDigitalWrite(spi_master->cs_pin, 1);
		spi_master->transmission = SPI_IDLE;
	}

